Autodesk.Revit.UI.UIControlledApplication.UpdateWorksharingActivityIndicator(System.Boolean,System.Collections.Generic.IList{System.String})
Updates model status on the Worksharing activity indicator.
Remarks:
The indicator is enabled only when the active document is cloud Worksharing.
centralIsBusy:
True if the central model is busy.
syncingUsernames:
An array with the usernames of the users which are currently syncing
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1